[net]
batch=1
subdivisions=1
height=224
width=224
channels=3

[convolutional]
filters=64
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=128
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[convolutional]
filters=128
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=256
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=512
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=512
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
shift_bit=-1
activation=linear

[activation]
activation=relu

[maxpool]
size=2
stride=2

[connected]
output=4096
shift_bit=-1
activation=linear

[activation]
activation=relu

[connected]
output=4096
shift_bit=-1
activation=linear

[activation]
activation=relu

[connected]
output=1
shift_bit=-1
activation=linear

