[net]
batch=1
subdivisions=1

height=28
width=28
channels=1

[convolutional]
filters=20
size=5
stride=1
pad=2
shift_bit=9
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=50
size=5
stride=1
pad=2
shift_bit=9
activation=relu

[maxpool]
size=2
stride=2

[connected]
output=500
shift_bit=9
activation=relu

[connected]
output=10
shift_bit=9
activation=linear
