[net]
batch=1
subdivisions=1
height=28
width=28
channels=1

[convolutional]
filters=32
size=3
stride=1
pad=1
shift_bit=9
activation=linear

[batchnorm]
shift_bit=6

[activation]
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
shift_bit=10
activation=linear

[batchnorm]
shift_bit=6

[activation]
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=64
size=3
stride=1
pad=1
shift_bit=10
activation=linear

[batchnorm]
shift_bit=6

[activation]
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
shift_bit=10
activation=linear

[batchnorm]
shift_bit=6

[activation]
activation=relu

[maxpool]
size=2
stride=2

[connected]
output=128
shift_bit=10
activation=linear

[activation]
activation=relu

[connected]
output=10
shift_bit=8
activation=linear

