[net]
batch=1
subdivisions=1
height=28
width=28
channels=1

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=linear

[activation]
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=linear

[activation]
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=32
size=1
stride=1
pad=0
activation=linear

[activation]
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=linear

[activation]
activation=relu

[shortcut]
from=-5

[maxpool]
size=2
stride=2

[connected]
output=256
activation=linear

[activation]
activation=relu

[connected]
output=10
activation=linear

